Tekla.Structures.Plugins.SecondaryTypeAttribute
The SecondaryTypeAttribute class is used for storing the number of needed secondaries in the connection.
Based on the type the system can then correctly ask for user input in the creation.
The attribute is initialized from the custom attribute i.e.
[SecondaryType(ConnectionBase.SecondaryType.SECONDARYTYPE_ONE)]
in the connection source.

Tekla.Structures.Plugins.SecondaryTypeAttribute.#ctor(Tekla.Structures.Plugins.ConnectionBase.SecondaryType)
The custom attribute [SecondaryType()] uses this to store the secondary type to the system.
This is not to be used by itself.
Type: The secondary type.

Tekla.Structures.Plugins.SecondaryTypeAttribute.Type
The custom attribute [SecondaryType()] uses this to store the secondary type to the system.
This is not to be used by itself.

Tekla.Structures.Plugins.SecondaryTypeAttribute.#ctor(System.Int32)
The custom attribute [SecondaryType()] uses this to store the secondary type to the system.
This is not to be used by itself.
Type: The secondary type.